Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: You cannot invoke the original overloading handlers of the class, and __set() only works to one level of property access.
pt_br: Você não pode invocar as chamadas originais da classe e __set() somente funciona até um nível de acesso de propriedades.

source: You 'll need to install the sqlcli library available in the Ovrimos SQL Server distribution.
pt_br: Instalação

source: DIR is the Ovrimos' libsqlcli install directory.
pt_br: Configuração durante execução

source: Connect to Ovrimos SQL Server and select from a system table
pt_br: Exemplo 1.

source: Process Control support in PHP implements the Unix style of process creation, program execution, signal handling and process termination.
pt_br: Process Control Functions

source: Currently, this module will not function on non-Unix platforms (Windows).
pt_br: Configuração durante execução

source: Please see your systems signal( 7) man page for details of the default behavior of these signals.
pt_br: Exemplos

source: ?php declare( ticks=1); $pid = pcntl_fork(); if ($pid == -1) {die("could not fork");} else if ($pid) {exit(); / / we are the parent} else {/ / we are the child} / / detatch from the controlling terminal if (!posix_setsid()) {die("could not detach from terminal");} / / setup signal handlers pcntl_signal(SIGTERM, "sig_handler"); pcntl_signal(SIGHUP, "sig_handler"); / / loop forever performing tasks while(1) {/ / do something interesting here} function sig_handler($signo) {switch($signo) {case SIGTERM: / / handle shutdown tasks exit; break; case SIGHUP: / / handle restart tasks break; default: / / handle all other signals}}?
pt_br: Veja Também

source: The syntax for patterns used in these functions closely resembles Perl.
pt_br: Regular Expression Functions (Perl-Compatible)

source: It is available at ftp: / /ftp.csx.cam.ac.uk / pub / software / programming / pcre /.
pt_br: Instalação

source: This flag is available since PHP 4.3.0 and is only used for preg_split().
pt_br: Exemplos

source: The PDF functions in PHP can create PDF files using the PDFlib library created by Thomas Merz.
pt_br: Introdução

source: When using version 3.x of PDFlib, you should configure PDFlib with the option --enable-shared-pdflib.
pt_br: Configuração durante execução

source: pdf_get_value() passing "imageheight "as the second parameter and the image as the third parameter.
pt_br: Exemplos

source: Example 2. pdfclock example from PDFlib distribution
pt_br: Exemplo 2. pdfclock example from PDFlib distribution

source: ?php $radius = 200; $margin = 20; $pagecount = 10; $pdf = pdf_new(); if (!pdf_open_file($pdf, "")) {print error; exit;}; pdf_set_parameter($pdf, "warning", "true"); pdf_set_info($pdf, "Creator", "pdf_clock.php"); pdf_set_info($pdf, "Author", "Uwe Steinmann"); pdf_set_info($pdf, "Title", "Analog Clock"); while($pagecount- - 0) {pdf_begin_page($pdf, 2 * ($radius + $margin), 2 * ($radius + $margin)); pdf_set_parameter($pdf, "transition", "wipe"); pdf_set_value($pdf, "duration", 0.5); pdf_translate($pdf, $radius + $margin, $radius + $margin); pdf_save($pdf); pdf_setrgbcolor($pdf, 0.0, 0.0, 1.0); / * minute strokes * / pdf_setlinewidth($pdf, 2.0); for ($alpha = 0; $alpha 360; $alpha += 6) {pdf_rotate($pdf, 6.0); pdf_moveto($pdf, $radius, 0.0); pdf_lineto($pdf, $radius-$margin / 3, 0.0); pdf_stroke($pdf);} pdf_restore($pdf); pdf_save($pdf); / * 5 minute strokes * / pdf_setlinewidth($pdf, 3.0); for ($alpha = 0; $alpha 360; $alpha += 30) {pdf_rotate($pdf, 30.0); pdf_moveto($pdf, $radius, 0.0); pdf_lineto($pdf, $radius-$margin, 0.0); pdf_stroke($pdf);} $ltime = getdate(); / * draw hour hand * / pdf_save($pdf); pdf_rotate($pdf, -(($ltime['minutes'] / 60.0)+$ltime['hours']-3.0)*30.0); pdf_moveto($pdf, -$radius / 10, -$radius / 20); pdf_lineto($pdf, $radius / 2, 0.0); pdf_lineto($pdf, -$radius / 10, $radius / 20); pdf_closepath($pdf); pdf_fill($pdf); pdf_restore($pdf); / * draw minute hand * / pdf_save($pdf); pdf_rotate($pdf, -(($ltime['seconds'] / 60.0)+$ltime['minutes']-15.0)*6.0); pdf_moveto($pdf, -$radius / 10, -$radius / 20); pdf_lineto($pdf, $radius * 0.8, 0.0); pdf_lineto($pdf, -$radius / 10, $radius / 20); pdf_closepath($pdf); pdf_fill($pdf); pdf_restore($pdf); / * draw second hand * / pdf_setrgbcolor($pdf, 1.0, 0.0, 0.0); pdf_setlinewidth($pdf, 2); pdf_save($pdf); pdf_rotate($pdf, -(($ltime['seconds'] - 15.0) * 6.0)); pdf_moveto($pdf, -$radius / 5, 0.0); pdf_lineto($pdf, $radius, 0.0); pdf_stroke($pdf); pdf_restore($pdf); / * draw little circle at center * / pdf_circle($pdf, 0, 0, $radius / 30); pdf_fill($pdf); pdf_restore($pdf); pdf_end_page($pdf); # to see some difference sleep(1);} pdf_close($pdf); $buf = pdf_get_buffer($pdf); $len = strlen($buf); header("Content-type: application / pdf"); header("Content-Length: $len"); header("Content-Disposition: inline; filename=foo.pdf"); print $buf; pdf_delete($pdf);?
pt_br: Veja Também

source: Copy the header file pfpro.h to / usr / local / include and the library file libpfpro.so to / usr / local / lib.
pt_br: Instalação

source: These functions are only available if PHP has been compiled with the --with-pfpro[ =DIR] option.
pt_br: Configuração durante execução

source: PostgreSQL database is Open Source product and available without cost.
pt_br: Introdução

source: Postgres, developed originally in the UC Berkeley Computer Science Department, pioneered many of the object-relational concepts now becoming available in some commercial databases.
pt_br: O Postgres, desenvolvido originalmente no Departamento de Ciência de Computação da Universidade de Berkeley, foi pioneiro em muitos dos conceitos objeto-relacionais que agora estão disponíveis em alguns bancos de dados comerciais.

source: It provides SQL92 / SQL99 language support, transaction integrity and type extensibility.
pt_br: Fornece suporte a linguagem SQL92 / SQL99, integridade de transações e extensibilidade de tipos.

source: PostgreSQL is an open source descendant of this original Berkeley code.
pt_br: O PostgreSQL é um descendente com código aberto do código original desenvolvido em Berkeley.

source: To use PostgreSQL support, you need PostgreSQL 6.5 or later, PostgreSQL 7.0 or later to enable all PostgreSQL module features.
pt_br: Para usar usar as funções para PostgreSQL, você precisa do PostgreSQL 6.5 ou superior e PostgreSQL 7.0 ou superior para habilitar todos os recursos deste módulo.

source: PostgreSQL supports many character encoding including multibyte character encoding.
pt_br: PostgreSQL suporta inúmeros tipos de codificação de caracteres incluindo a codificação de caracteres multibyte.

source: The current version and more information about PostgreSQL is available at http: / /www.postgresql.org /.
pt_br: Instalação

source: In order to enable PostgreSQL support, --with-pgsql[ =DIR] is required when you compile PHP.
pt_br: Para habilitar o módulo de funções para PostgreSQL, a opção de configuração --with-pgsql[ =DIR] deve ser usada no momento da compilação do PHP.

source: If shared object module is available, PostgreSQL module may be loaded using extension directive in php.ini or dl() function.
pt_br: Configuração durante execução

source: PostgreSQL configuration options
pt_br: Opções de configuração do PostgreSQL

source: Whether to allow persistent Postgres connections.
pt_br: Se quer ou não permitir conexões persistentes com o PostgreSQL.

source: The maximum number of persistent Postgres connections per process.
pt_br: O número máximo de conexões persistentes com PostgreSQL por processo.

source: The maximum number of Postgres connections per process, including persistent connections.
pt_br: Como usar e algumas dicas

source: Using the PostgreSQL module with PHP 4.0.6 is not recommended due to a bug in the notice message handling code.
pt_br: Usar o módulo PostgreSQL com o PHP 4.0.6 não é recomendado devido a um bug no código de manipulação de notificações.

source: Use 4.1.0 or later.
pt_br: Use o 4.1.0 ou superior.

source: PostgreSQL function names will be changed in 4.2.0 release to confirm to current coding standards.
pt_br: Os nomes das funções PostgreSQL serão alterados na versão 4.2.0 para confirmar os padrões de programação atuais.

source: Most of new names will have additional underscores, e.g. pg_lo_open().
pt_br: A maioria dos novos nomes terão sublinhados (underscore) adicionais, por exemplo, pg_lo_open().

source: Some functions are renamed to different name for consistency. e.g. pg_exec() to pg_query().
pt_br: Algumas funções foram renomeadas para uma maior consistência, por exemplo, pg_exec() mudou para pg_query().

source: Function names changed
pt_br: Tabela 2.

source: New name
pt_br: Nomes de funções alterados

source: The old pg_connect() / pg_pconnect() syntax will be deprecated to support asynchronous connections in the future.
pt_br: A antiga sintaxe pg_connect() / pg_pconnect() ficará obsoleta para suportar conexões assíncronas no futuro.

source: Please use a connection string for pg_connect() and pg_pconnect().
pt_br: Por favor, use a string de conexão para pg_connect() e pg_pconnect().

source: Not all functions are supported by all builds.
pt_br: Nem todas as funções são suportadas por todas as compilações.

source: It depends on your libpq (The PostgreSQL C Client interface) version and how libpq is compiled.
pt_br: Isso vai depender da versão da libpq (A interface cliente em C para PostgreSQL) e como esta foi compilada.

source: If there is missing function, libpq does not support the feature required for the function.
pt_br: Se há alguma função ausente, é porque a libpq não suporta a característica exigida por esta função.

source: It is also important that you do not use an older libpq than the PostgreSQL Server to which you will be connecting.
pt_br: Também é importante que você use uma versão da libpq mais nova do que a que o servidor exige.

source: If you use libpq older than PostgreSQL Server expects, you may have problems.
pt_br: Se você usar uma versão mais antiga do que a que o servidor espera, você poderá ter problemas.

source: Since version 6.3 (03 / 02 / 1998) PostgreSQL uses unix domain sockets by default.
pt_br: Desde a versão 6.3 (03 / 02 / 1998), o PostgreSQL usa sockets de domínio unix por padrão.

source: TCP port will NOT be opened by default.
pt_br: A porta TCP não ficará aberta por padrão.

source: A table is shown below describing these new connection possibilities.
pt_br: Uma tabela é mostrada abaixo descrevendo essas novas possibilidades de conexão.

source: This socket will be found in / tmp / .s.PGSQL.5432.
pt_br: Este socket será encontrado em / tmp / .s.PGSQL.5432.

source: This option can be enabled with the '-i' flag to postmaster and it's meaning is: "listen on TCP / IP sockets as well as Unix domain sockets ".
pt_br: Esta opção pode ser habilitada com o parâmetro '-i' para o postmaster e seu significado é: "escute em sockets TCP / IP assim como em sockets de domínio Unix ".

source: Postmaster and PHP
pt_br: Postmaster e PHP

source: A connection to PostgreSQL server can be established with the following value pairs set in the command string: $conn = pg_connect( "host=myHost port=myPort tty=myTTY options=myOptions dbname=myDB user=myUser password=myPassword ");
pt_br: Uma conexão com o servidor PostgreSQL pode ser estabelecida com os seguintes pares de valores definidos na string de comando: $conn = pg_connect( "host=seuHost port=suaPorta tty=seuTTY options=suasOpcoes dbname=seuDB user=seuUsuario password=suaSenha");

source: The previous syntax of: $conn = pg_connect ("host", "port", "options", "tty", "dbname") has been deprecated.
pt_br: A sintaxe anterior: $conn = pg_connect ("host", "porta", "opcoes", "tty", "nomebd") ficará obsoleta.

source: Environmental variables affect PostgreSQL server / client behavior.
pt_br: Variáveis de ambiente afetam o comportamento do servidor / cliente PostgreSQL.

source: For example, PostgreSQL module will lookup PGHOST environment variable when the hostname is omitted in the connection string.
pt_br: Por exemplo, o módulo PostgreSQL irá procurar pela variável de ambiente PGHOST quando o nome de host é omitido na string de conexão.

source: Supported environment variables are different from version to version.
pt_br: As variáveis de ambiente suportadas variam de versão para versão.

source: Refer to PostgreSQL Programmer' s Manual (libpq - Environment Variables) for details.
pt_br: Vide o Manual de Programador do PostgreSQL (Programmer´s Manual, na seção libpq - Enviroment Variables) para maiores detalhes.

source: Make sure you set environment variables for appropriate user.
pt_br: Certifique-se que você definiu as variáveis de ambiente para o usuário apropriado.

source: Use $_ENV or getenv() to check which environment variables are available to the current process.
pt_br: Use $_ENV ou getenv() para verificar se as variáveis de ambiente estão disponíveis para o processo atual.

source: Setting default parameters
pt_br: Definindo os parâmetros padrão

source: PGHOST=pgsql.example.com PGPORT=7890 PGDATABASE=web-system PGUSER=web-user PGPASSWORD=secret PGDATESTYLE=ISO PGTZ=JST PGCLIENTENCODING=EUC-JP export PGHOST PGPORT PGDATABASE PGUSER PGPASSWORD PGDATESTYLE PGTZ PGCLIENTENCODING
pt_br: Constantes Predefinidas

source: Starting with PostgreSQL 7.1.0, you can store up to 1GB into a field of type text.
pt_br: A partir do PostgreSQL 7.1.0, você pode armazenar até 1GB dentro de um campo do tipo texto.

source: In older versions, this was limited to the block size (default was 8KB, maximum was 32KB, defined at compile time)
pt_br: Em versões mais antigas, isto era limitado ao tamanho do bloco (o padrão era 8KB e o máximo era 32KB, definido em tempo de compilação).

source: To use the large object (lo) interface, it is required to enclose large object functions within a transaction block.
pt_br: Para usar a interface de objetos grandes (large objects), é exigido que se encapsule as funções de objetos grandes em um bloco de transação.

source: A transaction block starts with a SQL statement BEGIN and if the transaction was valid ends with COMMIT or END.
pt_br: Um bloco de transação inicia-se com a declaração SQL BEGIN e, se a transação for válida, termina com COMMIT ou END.

source: If the transaction fails the transaction should be closed with ROLLBACK or ABORT.
pt_br: Se a transação falhar, ela deve ser fechada com ROLLBACK ou ABORT.

source: Using Large Objects
pt_br: Usando Objetos Grandes (large objects)

source: These functions are only available under Windows 9.x, ME, NT4 and 2000.
pt_br: Printer functions

source: They have been added in PHP 4.0.4.
pt_br: Introdução

source: Printer configuration options
pt_br: O comportamento dessas funções podem ser modificado pelas configurações do php.ini.

source: To compile PHP with pspell support, you need the aspell and pspell libraries, available from http: / /aspell.sourceforge.net / and http: / /aspell.net / respectively.
pt_br: Instalação

source: If you have the libraries needed add the --with-pspell[ =dir] option when compiling PHP.
pt_br: Configuração durante execução

source: The readline() functions implement an interface to the GNU Readline library.
pt_br: GNU Readline

source: The libedit library is BSD licensend and available for download from http: / /sourceforge.net / projects / libedit /.
pt_br: Instalação

source: In order you want to use the libedit readline replacement, configure PHP --with-libedit[ =DIR].
pt_br: Esta extenção não define nenhum parâmetro de configuração no php.ini.

source: This module contains an interface to the GNU Recode library, version 3.5.
pt_br: GNU Recode functions

source: PHP also supports regular expressions using a Perl-compatible syntax using the PCRE functions.
pt_br: Introdução

source: ereg ("abc", $string); / * Returns true if"abc "is found anywhere in $string. * / ereg ("^abc", $string); / * Returns true if "abc"; is found at the beginning of $string. * / ereg ("abc$", $string); / * Returns true if "abc" is found at the end of $string. * / eregi ("(ozilla .[23]_BAR_MSIE.3)", $HTTP_USER_AGENT); / * Returns true if client browser is Netscape 2, 3 or MSIE 3. * / ereg ("([[:alnum :]]+) ([[:alnum :]]+) ([[:alnum :]]+)", $string,$regs); / * Places three space separated words into $regs[1], $regs[2] and $regs[3]. * / $string = ereg_replace ("^", "br /", $string); / * Put a br / tag at the beginning of $string. * / $string = ereg_replace ("$", "br /", $string); / * Put a br /; tag at the end of $string. * / $string = ereg_replace ("\n", "", $string); / * Get rid of any newline characters in $string. * /
pt_br: Veja Também

source: This module provides wrappers for the System V IPC family of functions.
pt_br: Semaphore, Shared Memory and IPC Functions

source: To enable the System V messages support compile PHP with the option --enable-sysvmsg.
pt_br: Configuração durante execução

source: SESAM / SQL-Server is a mainframe database system, developed by Fujitsu Siemens Computers, Germany.
pt_br: SESAM database functions

source: PHP 4 does not support the SESAM database.
pt_br: Configuração durante execução

source: The message catalog must be set ACCESS=READ,SHARE=YES because it must be readable by the apache server 's user id.
pt_br: Configuration notes

source: Because the SQL command quoting for single quotes uses duplicated single quotes (as opposed to a single quote preceded by a backslash, used in some other databases), it is advisable to set the PHP configuration directives php3_magic_quotes_gpc and php3_magic_quotes_sybase to On for all PHP scripts using the SESAM interface.
pt_br: Runtime considerations

source: Restrict access to php scripts which must administer the database by using password control and / or SSL security.
pt_br: Migration from other SQL databases

source: When specifying RESTRICT, an error is returned if there are dependent objects (e.g., VIEWs), while with CASCADE, dependent objects will be deleted along with the specified table.
pt_br: Notes on the use of various SQL types

source: Session support in PHP consists of a way to preserve certain data across subsequent accesses.
pt_br: XCIII.

source: This enables you to build more customized applications and increase the appeal of your web site.
pt_br: Manejo de sessões

source: A visitor accessing your web site is assigned an unique id, the so-called session id.
pt_br: Introdução

source: The session support allows you to register arbitrary numbers of variables to be preserved across requests.
pt_br: Suporte a sessões no PHP consiste em uma forma de preservar certos dados através de acessos subseqüentes.

source: All registered variables are serialized after the request finishes.
pt_br: Isto te permite construir aplicações mais personalizadas e aumenta a atração ao seu web site.

source: On subsequent accesses, these are not defined by the session module unless the user defines them later.
pt_br: Se você está familiarizado com o gerenciamento de sessões do PHPLIB, você irá notar que alguns conceitos são similares ao suporte de sessões do PHP.

source: Please note when working with sessions that a record of a session is not created until a variable has been registered using the session_register() function or by adding a new key to the $_SESSION superglobal array.
pt_br: Um visitante acessando seu web site está determinado por uma única id, a então chamada id de sessão.

source: External links:
pt_br: Esta ou é guardada em um cookie do lado do usuário ou está na URL.

source: The session module cannot guarantee that the information you store in a session is only viewed by the user who created the session.
pt_br: Sessões te permite registrar arbitrariamente números de variáveis para estarem lado a lado com os requerimentos.

source: Assess the importance of the data carried by your sessions and deploy addditional protections - - this usually comes at a price, reduced convenience for the user.
pt_br: Quando um visitante acessa seu site, o PHP checará automaticamente (se session.auto_start está definida para 1) ou no seu pedido (explicitamente através da session_start() ou implicitamente através da session_register()) se uma id de sessão especifica foi enviada com o pedido.

source: For example, if you want to protect users from simple social engineering tactics, you need to enable session.use_only_cookies.
pt_br: Se este é o caso, o ambiente anterior guardado é restaurado.

source: There are several ways to leak an existing session id to third parties.
pt_br: Todas as variáveis registradas são publicadas em série após o pedido terminar.

source: First, URLs carrying session ids.
pt_br: Variáveis registradas que estão indefinidas estão marcadas como estando não definida.

source: Second, a more active attacker might listen to your network traffic.
pt_br: Num acesso subseqüente, estas não estarão definidas pelo módulo da sessão a menos que o usuário defina elas mais tarde.

source: If it is not encrypted, session ids will flow in plain text over the network.
pt_br: Nota:

source: The solution here is to implement SSL on your server and make it mandatory for users.
pt_br: Manejo de sessões foi adicionado no PHP 4.0.

source: Engelschall, for session storage.
pt_br: Nenhuma biblioteca externa é necessária para compilar esta extensão.

source: This option is not available for Windows platforms.
pt_br: Instalação

source: Note that the session storage module for mm does not guarantee that concurrent accesses to the same session are properly locked.
pt_br: Suporte a sessões esta habilitado no PHP 4.0 por definição.

source: Session support is enabled in PHP by default.
pt_br: Se você não gostaria de seu PHP com suporte a sessão, você especifica a opção de configuração --disable-session.

source: If you would not like to build your PHP with session support, you should specify the --disable-session option to configure.
pt_br: Configuração durante execução

source: Session configuration options
pt_br: Por definição files.

source: session.save_path
pt_br: session.save_path session.save_path define o argumento que que é passado para o save handler.

source: session.save_handler
pt_br: Se você escolher o default files handler, este é o caminho onde os arquivos serão criados.

source: session.auto_start
pt_br: Por definição para / tmp.

source: session.gc_probability
pt_br: Se a profundidade do caminho de session.save_path é maior do que 2, coleção de lixo não será executada( garbage collection - gc).

source: session.gc_maxlifetime
pt_br: Atenção

source: session.serialize_handler
pt_br: Se você deixar isto definido para um diretório muito visível, tal como / tmp (o padrão), outros usuários do servidor poderão ser capazes de assumir o controle da sessão obtendo a lista de arquivos naquele diretório.

source: session.cookie_lifetime
pt_br: session.name session.name especifica o nome da sessão que é usada como nome de cookie.

source: session.cookie_path
pt_br: Ela poderia apenas conter caracteres alfanuméricos.

source: session.cookie_domain
pt_br: Por definição PHPSESSID.

source: session.cookie_secure
pt_br: session.auto_start session.auto_start especifica se o módulo da sessão inicia a sessão automaticamente num pedido na inicialização.

source: session.use_cookies
pt_br: Por definição 0 (desabilitado).

source: session.use_only_cookies
pt_br: session.cookie_lifetime especifica o tempo de vida de um cookie em segundos que é enviado para o navegador.

source: session.referer_check
pt_br: O valor 0 significa "até que o navegador seja fechado." Por definição 0.

source: session.entropy_file
pt_br: session.serialize_handler define o nome do operador( handler) que é usado para serializar / deserializar dados.

source: session.entropy_length
pt_br: Correntemente, um formato interno do PHP (nome php) e WDDX é suportado (nome wddx).
